#                   EDA ------- Exploratory Data Analysis
==========================================================================

Data Set: Students_data.csv

Questions :- 

                1. Obtain Descriptive Statistical Information about Student and their Examinations
                2. Obtain Complete Information about DataFrame which contains Student Information from CSV File Like memory
                space, Not Null Values, datatype column names ... etc
                3. Display all student records one by one
                4. Obtain First Five Records
                5. Obtain Last Five Records
                6. Obtain all student names in Capital Letters
                7. Obtain the Student Names and Maths Marks whose Maths Marks range between 80 and 90
                8. Obtain the Student Names whose Science Marks less than 60
                9. Obtain Top 5 Maths Scorers
                10. Obtain Least 5 Science Scorers
                11. Obtain the Names of Student whose Name Starts with a Letters "R"
                12. Calculate Total marks of all the students
                13. Calculate Percentage of all the students
                14. Give Grade for all students
                                (100-75 -- >Distinction, 
                                 75 - 60 --> First,
                                 60 - 50 --> Second,
                                 less than 50 -- Third) 
                15. Find Aggregation OR Average of all Marks of all stubjects

In [1]:
# lets import pandas and numpy first
import pandas as pd
import numpy as np

In [2]:
# lets load the data
students = pd.read_csv(r"C:\Users\prath\FullStackDataScience\my own folder\database\data_files\Students_data.csv", )
students.head()

,Unnamed: 0,htno,name,telugu,english,hindi,maths,science,social,total_marks,percentage,grades
0,0,100,Ramesh,50,60,66,98,66,55,395,65.83,First
1,1,101,Rajesh,45,67,34,67,66,78,357,59.50,Second
2,2,102,Rossum,56,88,56,99,44,77,420,70.00,First
3,3,103,Raji,56,78,34,56,88,55,367,61.17,Second
4,4,104,Kalyan,51,63,62,93,67,51,387,64.50,Second

In [3]:
students.drop(["Unnamed: 0"], axis  = 1, inplace = True)
students

,htno,name,telugu,english,hindi,maths,science,social,total_marks,percentage,grades
0,100,Ramesh,50,60,66,98,66,55,395,65.83,First
1,101,Rajesh,45,67,34,67,66,78,357,59.50,Second
2,102,Rossum,56,88,56,99,44,77,420,70.00,First
3,103,Raji,56,78,34,56,88,55,367,61.17,Second
4,104,Kalyan,51,63,62,93,67,51,387,64.50,Second
5,105,Karthik,48,62,39,68,65,88,370,61.67,Second
6,106,Kambli,53,81,59,92,48,73,406,67.67,First
7,107,Praveen,46,88,74,86,78,45,417,69.50,First
8,108,Ganesh,53,62,76,88,76,35,390,65.00,First
9,109,Nags,55,77,44,77,86,58,397,66.17,First
10,110,Biswa,66,48,86,95,48,47,390,65.00,First
11,111,Ritchi,66,68,64,76,98,75,447,74.50,First

In [4]:
# taking information about the students dataframe
students.info()

<class 'pandas.DataFrame'>
RangeIndex: 12 entries, 0 to 11
Data columns (total 11 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   htno         12 non-null     int64
 1   name         12 non-null     str
 2   telugu       12 non-null     int64
 3   english      12 non-null     int64
 4   hindi        12 non-null     int64
 5   maths        12 non-null     int64
 6   science      12 non-null     int64
 7   social       12 non-null     int64
 8   total_marks  12 non-null     int64
 9   percentage   12 non-null     float64
 10  grades       12 non-null     str
dtypes: float64(1), int64(8), str(2)
memory usage: 1.2 KB

In [5]:
# another function to get the information about the dataframe :

students.describe(include="all")

,htno,name,telugu,english,hindi,maths,science,social,total_marks,percentage,grades
count,12.000000,12,12.000000,12.000000,12.000000,12.000000,12.000000,12.000000,12.000000,12.000000,12
unique,NaN,12,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,2
top,NaN,Ramesh,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,First
freq,NaN,1,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,8
mean,105.500000,NaN,53.750000,70.166667,57.833333,82.916667,69.166667,61.416667,395.250000,65.875833,NaN
std,3.605551,NaN,6.770591,12.268462,17.039171,13.931379,16.964312,16.295333,25.053125,4.175028,NaN
min,100.000000,NaN,45.000000,48.000000,34.000000,56.000000,44.000000,35.000000,357.000000,59.500000,NaN
25%,102.750000,NaN,49.500000,62.000000,42.750000,74.000000,60.750000,50.000000,382.750000,63.792500,NaN
50%,105.500000,NaN,53.000000,67.500000,60.500000,87.000000,66.500000,56.500000,392.500000,65.415000,NaN
75%,108.250000,NaN,56.000000,78.750000,68.000000,93.500000,80.000000,75.500000,408.750000,68.127500,NaN
max,111.000000,NaN,66.000000,88.000000,86.000000,99.000000,98.000000,88.000000,447.000000,74.500000,NaN

In [6]:
# print the rows by iterating the dataframe : 
for record in students.iterrows() : 
    print(record)

(0, htno              100
name           Ramesh
telugu             50
english            60
hindi              66
maths              98
science            66
social             55
total_marks       395
percentage      65.83
grades          First
Name: 0, dtype: object)
(1, htno              101
name           Rajesh
telugu             45
english            67
hindi              34
maths              67
science            66
social             78
total_marks       357
percentage       59.5
grades         Second
Name: 1, dtype: object)
(2, htno              102
name           Rossum
telugu             56
english            88
hindi              56
maths              99
science            44
social             77
total_marks       420
percentage       70.0
grades          First
Name: 2, dtype: object)
(3, htno              103
name             Raji
telugu             56
english            78
hindi              34
maths              56
science            88
social             55
total_marks       367
percentage      61.17
grades         Second
Name: 3, dtype: object)
(4, htno              104
name           Kalyan
telugu             51
english            63
hindi              62
maths              93
science            67
social             51
total_marks       387
percentage       64.5
grades         Second
Name: 4, dtype: object)
(5, htno               105
name           Karthik
telugu              48
english             62
hindi               39
maths               68
science             65
social              88
total_marks        370
percentage       61.67
grades          Second
Name: 5, dtype: object)
(6, htno              106
name           Kambli
telugu             53
english            81
hindi              59
maths              92
science            48
social             73
total_marks       406
percentage      67.67
grades          First
Name: 6, dtype: object)
(7, htno               107
name           Praveen
telugu              46
english             88
hindi               74
maths               86
science             78
social              45
total_marks        417
percentage        69.5
grades           First
Name: 7, dtype: object)
(8, htno              108
name           Ganesh
telugu             53
english            62
hindi              76
maths              88
science            76
social             35
total_marks       390
percentage       65.0
grades          First
Name: 8, dtype: object)
(9, htno             109
name            Nags
telugu            55
english           77
hindi             44
maths             77
science           86
social            58
total_marks      397
percentage     66.17
grades         First
Name: 9, dtype: object)
(10, htno             110
name           Biswa
telugu            66
english           48
hindi             86
maths             95
science           48
social            47
total_marks      390
percentage      65.0
grades         First
Name: 10, dtype: object)
(11, htno              111
name           Ritchi
telugu             66
english            68
hindi              64
maths              76
science            98
social             75
total_marks       447
percentage       74.5
grades          First
Name: 11, dtype: object)

In [7]:
# another method to iterate over the dataframe :
for entry in students.itertuples(name="students") :
    print(entry, type(entry))

students(Index=0, htno=100, name='Ramesh', telugu=50, english=60, hindi=66, maths=98, science=66, social=55, total_marks=395, percentage=65.83, grades='First') <class 'pandas.core.frame.students'>
students(Index=1, htno=101, name='Rajesh', telugu=45, english=67, hindi=34, maths=67, science=66, social=78, total_marks=357, percentage=59.5, grades='Second') <class 'pandas.core.frame.students'>
students(Index=2, htno=102, name='Rossum', telugu=56, english=88, hindi=56, maths=99, science=44, social=77, total_marks=420, percentage=70.0, grades='First') <class 'pandas.core.frame.students'>
students(Index=3, htno=103, name='Raji', telugu=56, english=78, hindi=34, maths=56, science=88, social=55, total_marks=367, percentage=61.17, grades='Second') <class 'pandas.core.frame.students'>
students(Index=4, htno=104, name='Kalyan', telugu=51, english=63, hindi=62, maths=93, science=67, social=51, total_marks=387, percentage=64.5, grades='Second') <class 'pandas.core.frame.students'>
students(Index=5, htno=105, name='Karthik', telugu=48, english=62, hindi=39, maths=68, science=65, social=88, total_marks=370, percentage=61.67, grades='Second') <class 'pandas.core.frame.students'>
students(Index=6, htno=106, name='Kambli', telugu=53, english=81, hindi=59, maths=92, science=48, social=73, total_marks=406, percentage=67.67, grades='First') <class 'pandas.core.frame.students'>
students(Index=7, htno=107, name='Praveen', telugu=46, english=88, hindi=74, maths=86, science=78, social=45, total_marks=417, percentage=69.5, grades='First') <class 'pandas.core.frame.students'>
students(Index=8, htno=108, name='Ganesh', telugu=53, english=62, hindi=76, maths=88, science=76, social=35, total_marks=390, percentage=65.0, grades='First') <class 'pandas.core.frame.students'>
students(Index=9, htno=109, name='Nags', telugu=55, english=77, hindi=44, maths=77, science=86, social=58, total_marks=397, percentage=66.17, grades='First') <class 'pandas.core.frame.students'>
students(Index=10, htno=110, name='Biswa', telugu=66, english=48, hindi=86, maths=95, science=48, social=47, total_marks=390, percentage=65.0, grades='First') <class 'pandas.core.frame.students'>
students(Index=11, htno=111, name='Ritchi', telugu=66, english=68, hindi=64, maths=76, science=98, social=75, total_marks=447, percentage=74.5, grades='First') <class 'pandas.core.frame.students'>

In [8]:
# Getting the First Five records from the dataframe :
students.head()

,htno,name,telugu,english,hindi,maths,science,social,total_marks,percentage,grades
0,100,Ramesh,50,60,66,98,66,55,395,65.83,First
1,101,Rajesh,45,67,34,67,66,78,357,59.50,Second
2,102,Rossum,56,88,56,99,44,77,420,70.00,First
3,103,Raji,56,78,34,56,88,55,367,61.17,Second
4,104,Kalyan,51,63,62,93,67,51,387,64.50,Second

In [9]:
# Getting the last 5 entries :
students.tail()

,htno,name,telugu,english,hindi,maths,science,social,total_marks,percentage,grades
7,107,Praveen,46,88,74,86,78,45,417,69.50,First
8,108,Ganesh,53,62,76,88,76,35,390,65.00,First
9,109,Nags,55,77,44,77,86,58,397,66.17,First
10,110,Biswa,66,48,86,95,48,47,390,65.00,First
11,111,Ritchi,66,68,64,76,98,75,447,74.50,First

In [10]:
# getting all the students name that too in capital letter 
print([i.upper() for i in students["name"].values])

['RAMESH', 'RAJESH', 'ROSSUM', 'RAJI', 'KALYAN', 'KARTHIK', 'KAMBLI', 'PRAVEEN', 'GANESH', 'NAGS', 'BISWA', 'RITCHI']

In [11]:
# more preffered to use this as it returns the pandas series object
students["name"].str.upper()

0      RAMESH
1      RAJESH
2      ROSSUM
3        RAJI
4      KALYAN
5     KARTHIK
6      KAMBLI
7     PRAVEEN
8      GANESH
9        NAGS
10      BISWA
11     RITCHI
Name: name, dtype: str

In [12]:
# getting the students name with maths marks range between 80 and 90 

stu_math = students[(students["maths"] <= 90) & (students["maths"] >= 80)]
stu_math[["name", "maths"]]

      name  maths
7  Praveen     86
8   Ganesh     88

In [13]:
# Range filter using .between()
# mask = 
students.loc[students["maths"].between(80, 90), ["name", "maths"]]
# result = students.loc[mask, ["name", "maths"]]
# print(result)

      name  maths
7  Praveen     86
8   Ganesh     88

In [14]:
# lets find out which student struggling with the science subject that will bring us to question no. 8 that is finding the students name with the score of less than 60 in science.

# using the index chaining which can sometimes leads to performance issues or warning, so use the loc[] or iloc[] which is mentioned in the next cell 
students[students["science"] <= 60][["name", "science"]]

      name  science
2   Rossum       44
6   Kambli       48
10   Biswa       48

In [15]:
# use .loc or .iloc cause that will give us a more pro-pandas confidenfe 
students.loc[students["science"] < 60, ["name", "science"]]

      name  science
2   Rossum       44
6   Kambli       48
10   Biswa       48

In [16]:
# getting Top 5 students in mathematics :
students.sort_values(by = ["maths"], ascending = False).head()

,htno,name,telugu,english,hindi,maths,science,social,total_marks,percentage,grades
2,102,Rossum,56,88,56,99,44,77,420,70.00,First
0,100,Ramesh,50,60,66,98,66,55,395,65.83,First
10,110,Biswa,66,48,86,95,48,47,390,65.00,First
4,104,Kalyan,51,63,62,93,67,51,387,64.50,Second
6,106,Kambli,53,81,59,92,48,73,406,67.67,First

In [17]:
# Getting the 5 low scorer in science 

students.sort_values(by= "science").head()[["name", "science"]]

       name  science
2    Rossum       44
6    Kambli       48
10    Biswa       48
5   Karthik       65
1    Rajesh       66

In [18]:
# get the names of the students whose name starts with the letter "R".

students.loc[students["name"].str.startswith('R'), ["name", "grades"]]

      name  grades
0   Ramesh   First
1   Rajesh  Second
2   Rossum   First
3     Raji  Second
11  Ritchi   First

In [19]:
# or I can do 
# get the names of the students whose name starts with the letter "R" and ends with the letter 'h'

students.loc[(students["name"].str.startswith('R')) & (students["name"].str.endswith('h')), ["name", "grades"]]

     name  grades
0  Ramesh   First
1  Rajesh  Second

so we already have the columns for step 12 - 15, lets first delete it and the we can again do that from the scratch.

In [20]:
# lets check the columns first 
students.columns

Index(['htno', 'name', 'telugu', 'english', 'hindi', 'maths', 'science',
       'social', 'total_marks', 'percentage', 'grades'],
      dtype='str')

In [21]:
# lets delete multiple rows in one go. 

new_students = students.drop(["total_marks", "percentage", "grades"], axis = 1)

In [22]:
# checking the dataframe 
print(students)
print(new_students)

    htno     name  telugu  english  hindi  maths  science  social  \
0    100   Ramesh      50       60     66     98       66      55
1    101   Rajesh      45       67     34     67       66      78
2    102   Rossum      56       88     56     99       44      77
3    103     Raji      56       78     34     56       88      55
4    104   Kalyan      51       63     62     93       67      51
5    105  Karthik      48       62     39     68       65      88
6    106   Kambli      53       81     59     92       48      73
7    107  Praveen      46       88     74     86       78      45
8    108   Ganesh      53       62     76     88       76      35
9    109     Nags      55       77     44     77       86      58
10   110    Biswa      66       48     86     95       48      47
11   111   Ritchi      66       68     64     76       98      75

    total_marks  percentage  grades
0           395       65.83   First
1           357       59.50  Second
2           420       70.00   First
3           367       61.17  Second
4           387       64.50  Second
5           370       61.67  Second
6           406       67.67   First
7           417       69.50   First
8           390       65.00   First
9           397       66.17   First
10          390       65.00   First
11          447       74.50   First
    htno     name  telugu  english  hindi  maths  science  social
0    100   Ramesh      50       60     66     98       66      55
1    101   Rajesh      45       67     34     67       66      78
2    102   Rossum      56       88     56     99       44      77
3    103     Raji      56       78     34     56       88      55
4    104   Kalyan      51       63     62     93       67      51
5    105  Karthik      48       62     39     68       65      88
6    106   Kambli      53       81     59     92       48      73
7    107  Praveen      46       88     74     86       78      45
8    108   Ganesh      53       62     76     88       76      35
9    109     Nags      55       77     44     77       86      58
10   110    Biswa      66       48     86     95       48      47
11   111   Ritchi      66       68     64     76       98      75

In [23]:
# lets move towards the step 12 as now we want total marks :

new_students["total_marks"] = students[["telugu","english","hindi", "maths", "science","social"]].sum(axis= 1)
new_students

    htno     name  telugu  english  hindi  maths  science  social  total_marks
0    100   Ramesh      50       60     66     98       66      55          395
1    101   Rajesh      45       67     34     67       66      78          357
2    102   Rossum      56       88     56     99       44      77          420
3    103     Raji      56       78     34     56       88      55          367
4    104   Kalyan      51       63     62     93       67      51          387
5    105  Karthik      48       62     39     68       65      88          370
6    106   Kambli      53       81     59     92       48      73          406
7    107  Praveen      46       88     74     86       78      45          417
8    108   Ganesh      53       62     76     88       76      35          390
9    109     Nags      55       77     44     77       86      58          397
10   110    Biswa      66       48     86     95       48      47          390
11   111   Ritchi      66       68     64     76       98      75          447

In [24]:
# lets define new percentage column

new_students["percentage"] = round(new_students["total_marks"]/6, 2)
new_students

,htno,name,telugu,english,hindi,maths,science,social,total_marks,percentage
0,100,Ramesh,50,60,66,98,66,55,395,65.83
1,101,Rajesh,45,67,34,67,66,78,357,59.50
2,102,Rossum,56,88,56,99,44,77,420,70.00
3,103,Raji,56,78,34,56,88,55,367,61.17
4,104,Kalyan,51,63,62,93,67,51,387,64.50
5,105,Karthik,48,62,39,68,65,88,370,61.67
6,106,Kambli,53,81,59,92,48,73,406,67.67
7,107,Praveen,46,88,74,86,78,45,417,69.50
8,108,Ganesh,53,62,76,88,76,35,390,65.00
9,109,Nags,55,77,44,77,86,58,397,66.17
10,110,Biswa,66,48,86,95,48,47,390,65.00
11,111,Ritchi,66,68,64,76,98,75,447,74.50

In [25]:
# lets define the grade column 

# we have two ways 1st :

new_students["grade"] = [ "DISTINCTION" if i >= 75 else "FIRST" if i >= 65 else "SECOND" if i >= 55 else "THIRD" for i in new_students["percentage"]]
new_students

,htno,name,telugu,english,hindi,maths,science,social,total_marks,percentage,grade
0,100,Ramesh,50,60,66,98,66,55,395,65.83,FIRST
1,101,Rajesh,45,67,34,67,66,78,357,59.50,SECOND
2,102,Rossum,56,88,56,99,44,77,420,70.00,FIRST
3,103,Raji,56,78,34,56,88,55,367,61.17,SECOND
4,104,Kalyan,51,63,62,93,67,51,387,64.50,SECOND
5,105,Karthik,48,62,39,68,65,88,370,61.67,SECOND
6,106,Kambli,53,81,59,92,48,73,406,67.67,FIRST
7,107,Praveen,46,88,74,86,78,45,417,69.50,FIRST
8,108,Ganesh,53,62,76,88,76,35,390,65.00,FIRST
9,109,Nags,55,77,44,77,86,58,397,66.17,FIRST
10,110,Biswa,66,48,86,95,48,47,390,65.00,FIRST
11,111,Ritchi,66,68,64,76,98,75,447,74.50,FIRST

In [26]:
# for second way first we need to drop the grade column
new_students.drop(["grade"], axis=1, inplace = True)
new_students

,htno,name,telugu,english,hindi,maths,science,social,total_marks,percentage
0,100,Ramesh,50,60,66,98,66,55,395,65.83
1,101,Rajesh,45,67,34,67,66,78,357,59.50
2,102,Rossum,56,88,56,99,44,77,420,70.00
3,103,Raji,56,78,34,56,88,55,367,61.17
4,104,Kalyan,51,63,62,93,67,51,387,64.50
5,105,Karthik,48,62,39,68,65,88,370,61.67
6,106,Kambli,53,81,59,92,48,73,406,67.67
7,107,Praveen,46,88,74,86,78,45,417,69.50
8,108,Ganesh,53,62,76,88,76,35,390,65.00
9,109,Nags,55,77,44,77,86,58,397,66.17
10,110,Biswa,66,48,86,95,48,47,390,65.00
11,111,Ritchi,66,68,64,76,98,75,447,74.50

In [28]:
# second way to do it 

# we will define a user defined function for this task :
def set_grade(percent) :
    if percent >= 75 :
        return "DISTINCTION"
    elif percent >= 65 :
        return "FIRST"
    elif percent >= 55 :
        return "SECOND"
    else :
        return "THIRD"
    

new_students["grades"] = new_students["percentage"].apply(set_grade)
new_students

,htno,name,telugu,english,hindi,maths,science,social,total_marks,percentage,grades
0,100,Ramesh,50,60,66,98,66,55,395,65.83,FIRST
1,101,Rajesh,45,67,34,67,66,78,357,59.50,SECOND
2,102,Rossum,56,88,56,99,44,77,420,70.00,FIRST
3,103,Raji,56,78,34,56,88,55,367,61.17,SECOND
4,104,Kalyan,51,63,62,93,67,51,387,64.50,SECOND
5,105,Karthik,48,62,39,68,65,88,370,61.67,SECOND
6,106,Kambli,53,81,59,92,48,73,406,67.67,FIRST
7,107,Praveen,46,88,74,86,78,45,417,69.50,FIRST
8,108,Ganesh,53,62,76,88,76,35,390,65.00,FIRST
9,109,Nags,55,77,44,77,86,58,397,66.17,FIRST
10,110,Biswa,66,48,86,95,48,47,390,65.00,FIRST
11,111,Ritchi,66,68,64,76,98,75,447,74.50,FIRST

In [37]:
# now we see the aggregation of all the subjects 

average_marks = new_students[["telugu", "english", "hindi", "maths", "science", "social"]].mean(axis=0)
average_marks

telugu     53.750000
english    70.166667
hindi      57.833333
maths      82.916667
science    69.166667
social     61.416667
dtype: float64

In [ ]:
# we are done here we have done :

 Final Review
You've successfully navigated through:

1. Data Inspection (.info(), .describe()) 

1. Filtering & Sorting (.loc, .between(), .sort_values()) 

3. Data Cleaning (Deleting columns with del or .drop()) 

4. Feature Engineering (Calculating total_marks, percentage, and grades) 

5. Aggregation (.mean(axis=0))